//定义方式：
//数据定义 数组名[行数] [列数]
//数据定义 数组名[行数] [列数]={{数据1，数据2}，{数据3，数据4}}
//数据定义 数组名[行数] [列数]={数据1，数据2，数据3，数据4}
//数据类型 数组名[   ] [列数]={数据1，数据2，数据3，数据4}
#include <iostream>
using namespace std;
int main ()
{
    //1. 数据定义 数组名 [行数] [列数]
        //外层循环打印行数，内层循环打印列数
        // int arr[2][3]={{1,2,3},{4,5,6}};//如果不定义 出来的就是垃圾值
        // for (int i=0;i<2;i++)
        // {
        //     for (int j=0;j<3;j++)
        //     {
        //         cout<<arr[i][j]<<endl;
        //     }
        // }

   //2.第二种
    // int arr[2][3]={
    //         {1,2,3},
    //         {4,5,6}
    //     };
    // for (int i=0;i<2;i++)
    // {
    //     for (int j=0;j<3;j++)
    //     {
    //         cout<<arr[i][j]<<" ";
    //     }
    //     cout<<endl;
    // }

    //3.第三种
    // int arr[2][3]={1,2,3,4,5,6};
    // for (int i=0;i<2;i++)
    // {
    //     for (int j=0;j<3;j++)
    //     {
    //         cout<<arr[i][j]<<" ";
    //     }
    //     cout<<endl;
    // }

    //4.第四种
    int arr[][3]={1,2,3,4,5,6,};
    for (int i=0;i<2;i++)
    {
        for (int j=0;j<3;j++)
        {
            cout<<arr[i][j]<<" ";
        }
        cout<<endl;
    }
    return 0;
}